IdeaRS.OpenModel.Loading.LoadCaseType
Load case type

IdeaRS.OpenModel.Loading.LoadCaseType.Permanent
Permanent

IdeaRS.OpenModel.Loading.LoadCaseType.Variable
Variable

IdeaRS.OpenModel.Loading.LoadCaseType.Accidental
Accidental

IdeaRS.OpenModel.Loading.LoadCaseType.Nonlinear
Loadcase is for nonlinear analysis